kamal2730/line-follower-stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal_flash.h"
#include "stm32f4xx_hal_flash_ex.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <math.h>
#include <string.h>
#include <stdio.h>


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define MAX_INTEGRAL 25.0
#define DEADBAND 2.0
#define LINE_LOST_TIMEOUT 1000  // milliseconds
#define EMERGENCY_STOP_THRESHOLD 2000  // ADC value for emergency stop

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_usart6_rx;

/* USER CODE BEGIN PV */

// ADC buffer for sensor readings
uint32_t adc_buffer[8];
uint32_t minValues[8];
uint32_t maxValues[8];

// Line following parameters
int sensorWeight[8] = {0,20 ,40,60,80,100,120,140};
int thresh[8] = {900,900,900,900,900,900,900,900};  // Threshold for black line detection
int position;
int callibrate_flag=0;
uint32_t line_lost_time = 0;
int emergency_stop = 0;
uint8_t printsensor_flag=0;
uint8_t printsensorraw_flag=0;

// PID variables
double Kp = 13.5;
double Ki = 0.01;
double Kd = 4;
double error = 0;
double P = 0, I = 0, D = 0;
double lastError = 0;
double lastInput = 0;
uint32_t lastTime = 0;
int setpoint = 70;

// Motor control
double base_speed = 200;
double correction = 0;
int turn = 0;

//UART COMMUNICATION
uint8_t rx_buffer[16], main_buffer[16];

//EEPROM
#define FLASH_USER_START_ADDR  0x08020000
#define FLASH_SECTOR_TO_ERASE FLASH_SECTOR_5
#define EEPROM_MAGIC 0xDEADBEEF


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_NVIC_Init(void);

/* USER CODE BEGIN PFP */
void setMotorSpeed(uint8_t motor, int32_t speed);
int line_data(void);
void computePID(double error, int32_t input);
void checkAndHandleTurn();
void calibrate();
void setPIDParameter(char *input);
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size);
void printSensorState();
void saveToFlash();
void printSensorValues();

/* USER CODE END PFP */
/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// Motor control function
void setMotorSpeed(uint8_t motor, int32_t speed) {
    uint16_t pwm = abs(speed);
    if (pwm > 200) pwm = 200;  // Limit max speed

    if (motor == 0) {  // Left motor
        if (speed > 0) {
            TIM1->CCR1 = pwm;
            TIM1->CCR2 = 0;
        } else {
            TIM1->CCR1 = 0;
            TIM1->CCR2 = pwm;
        }
    }
    else if (motor == 1) {  // Right motor
        if (speed > 0) {
            TIM2->CCR1 = pwm;
            TIM3->CCR1 = 0;
        } else {
            TIM2->CCR1 = 0;
            TIM3->CCR1 = pwm;
        }
    }
}

// Line position calculation with timeout
int line_data(void) {
    int sum = 0;
    int weighted_sum = 0;
    int onLine = 0;

    for (int i = 0; i < 8; i++) {
        if (adc_buffer[i] > thresh[i]) {
            weighted_sum += sensorWeight[i];
            sum += 1;
            onLine = 1;
        }
    }

    if (!onLine) {
        return 255;  // Line lost condition
    }

    line_lost_time = 0;  // Reset timeout if line is found
    return weighted_sum / sum;
}

// PID computation
void computePID(double error, int32_t input) {

    double timeChange = (double)(HAL_GetTick() - lastTime);
    if (timeChange <= 0) timeChange = 1;

    // Calculate PID terms
    P = Kp * error;

    // Anti-windup: only integrate if output isn't saturated
    if(fabs(correction) < base_speed) {
        I += Ki * error * timeChange;
        // Limit integral term
        if(I > MAX_INTEGRAL) I = MAX_INTEGRAL;
        if(I < -MAX_INTEGRAL) I = -MAX_INTEGRAL;
    }

    // Filtered derivative term
    D = Kd * (input - lastInput) / timeChange;

    // Calculate correction
    correction = P + I + D;

    // Limit correction to base speed
    if(correction > base_speed) correction = base_speed;
    if(correction < -base_speed) correction = -base_speed;

    // Update variables for next iteration
    lastError = error;
    lastInput = input;
    lastTime = HAL_GetTick();

    // Apply motor speeds
    setMotorSpeed(0, base_speed - correction);
    setMotorSpeed(1, base_speed + correction);
}



// Non-blocking callibrate()
void callibrate() {
    static uint32_t start_time = 0;
    static uint8_t init_done = 0;

    if (!init_done) {
        for (int i = 0; i < 8; i++) {
            minValues[i] = adc_buffer[i];
            maxValues[i] = adc_buffer[i];
        }
        start_time = HAL_GetTick();
        init_done = 1;
    }

    if (HAL_GetTick() - start_time < 10000) {  // Run for 10 seconds
        HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_buffer, 8);

