kamal2730/line-follower-stm32/Core/Src/main.c
        for (int i = 0; i < 8; i++) {
            if (adc_buffer[i] < minValues[i]) minValues[i] = adc_buffer[i];
            if (adc_buffer[i] > maxValues[i]) maxValues[i] = adc_buffer[i];
        }
    } else {
        for (int i = 0; i < 8; i++) {
            thresh[i] = (minValues[i] + maxValues[i]) / 2;
        }

        char done[] = "Calibration done\n";
        HAL_UART_Transmit(&huart6, (uint8_t*)done, strlen(done), HAL_MAX_DELAY);

        // Reset state
        init_done = 0;
        callibrate_flag = 0;
    }
}


void setPIDParameter(char *input) {
    char *ptr = input;

    while (*ptr != '\0') {
        char type = *ptr;
        ptr++;

        char valueStr[12] = {0};
        int i = 0;

        while (*ptr != 'P' && *ptr != 'p' &&
               *ptr != 'I' && *ptr != 'i' &&
               *ptr != 'D' && *ptr != 'd' &&
               *ptr != '\0') {
            valueStr[i++] = *ptr++;
        }

        double value = atof(valueStr);

        switch (type) {
            case 'P': case 'p':
                Kp = value;
                break;
            case 'I': case 'i':
                Ki = value;
                break;
            case 'D': case 'd':
                Kd = value;
                break;
        }
    }

    char confirm[] = "PID updated\n";
    HAL_UART_Transmit(&huart6, (uint8_t*)confirm, strlen(confirm), HAL_MAX_DELAY);
//    saveToFlash();
}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size) {
    if (huart->Instance == USART6) {
        memset(main_buffer, '\0', 16);
        memcpy(main_buffer, rx_buffer, Size);
        memset(rx_buffer, '\0', 16);
        main_buffer[Size] = '\0';

        int len = strlen((char*)main_buffer);
        while (len > 0 && (main_buffer[len-1] == '\r' || main_buffer[len-1] == '\n')) {
            main_buffer[--len] = '\0';
        }

        // Handle 'Q' query
        if (strcmp((char*)main_buffer, "Q") == 0) {
            char status[128];

            // Send PID values
            snprintf(status, sizeof(status),
                "Kp=%d.%02d Ki=%d.%03d Kd=%d.%02d\nThresh: ",
                (int)Kp, (int)(Kp * 100) % 100,
                (int)Ki, (int)(Ki * 1000) % 1000,
                (int)Kd, (int)(Kd * 100) % 100);
            HAL_UART_Transmit(&huart6, (uint8_t*)status, strlen(status), HAL_MAX_DELAY);

            // Send all 8 threshold values in one line
            for (int i = 0; i < 8; i++) {
                char tbuf[8];
                sprintf(tbuf, "%d ", thresh[i]);
                HAL_UART_Transmit(&huart6, (uint8_t*)tbuf, strlen(tbuf), HAL_MAX_DELAY);
            }

            HAL_UART_Transmit(&huart6, (uint8_t*)"\n", 1, HAL_MAX_DELAY);
        }

        // Handle 'C' or 'c' for calibration
        else if ((main_buffer[0] == 'C' || main_buffer[0] == 'c') && len ==1) {
        	callibrate_flag=1;
        }
        else if ((main_buffer[0] == 'M' || main_buffer[0] == 'm') && len ==1){
        	printsensor_flag=(printsensor_flag==1)?0:1;
        }
        // Fallback: PID parameter input
        else if ((main_buffer[0] == 'R' || main_buffer[0] == 'r') && len ==1){
                	printsensorraw_flag=(printsensorraw_flag==1)?0:1;
                }
        else {
            setPIDParameter((char*) main_buffer);
        }

        // Restart DMA reception
        HAL_UARTEx_ReceiveToIdle_DMA(&huart6, rx_buffer, 16);
        __HAL_DMA_DISABLE_IT(&hdma_usart6_rx, DMA_IT_HT);
    }
}

void printSensorState(void) {
    // Print sensor readings visually
    for (int i = 0; i < 8; i++) {
        if (adc_buffer[i] > thresh[i])
            HAL_UART_Transmit(&huart6, (uint8_t*)" | ", 3, HAL_MAX_DELAY);
        else
            HAL_UART_Transmit(&huart6, (uint8_t*)" 0 ", 3, HAL_MAX_DELAY);
    }

    // Print current line position
    char msg[32];
    sprintf(msg, " -> Pos: %d\n", position);
    HAL_UART_Transmit(&huart6, (uint8_t*)msg, strlen(msg), HAL_MAX_DELAY);
}

void printSensorValues(void) {
    char msg[64];

    HAL_UART_Transmit(&huart6, (uint8_t*)"Sensor Values: ", 15, HAL_MAX_DELAY);

    for (int i = 0; i < 8; i++) {
        sprintf(msg, "%4lu ", adc_buffer[i]);
        HAL_UART_Transmit(&huart6, (uint8_t*)msg, strlen(msg), HAL_MAX_DELAY);
    }

    HAL_UART_Transmit(&huart6, (uint8_t*)"\r\n", 2, HAL_MAX_DELAY);
}

void saveToFlash() {

    HAL_FLASH_Unlock();

    FLASH_EraseInitTypeDef EraseInitStruct;
    uint32_t SectorError;
    uint32_t address = FLASH_USER_START_ADDR;

    EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
    EraseInitStruct.Sector = FLASH_SECTOR_TO_ERASE;
    EraseInitStruct.NbSectors = 1;
    EraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;

    if (HAL_FLASHEx_Erase(&EraseInitStruct, &SectorError) != HAL_OK) {
        HAL_FLASH_Lock();
        return;
    }

    // Write magic number
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, EEPROM_MAGIC);
    address += 8;

    // Write PID
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, *(double*)&Kp); address += 8;
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, *(double*)&Ki); address += 8;
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, *(double*)&Kd); address += 8;

    // Write threshold array
    for (int i = 0; i < 8; i++) {
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, (uint64_t)thresh[i]);
        address += 4;
    }

    HAL_FLASH_Lock();
}

void loadFromFlash() {
    uint32_t address = FLASH_USER_START_ADDR;

    uint32_t magic = *(uint64_t*)address;
    address += 8;

    if (magic != EEPROM_MAGIC) {
        // Flash is empty or invalid — don't load
        return;
    }

    // Load PID values
    Kp = *(double*)address; address += 8;
    Ki = *(double*)address; address += 8;
    Kd = *(double*)address; address += 8;

    // Load threshold array
    for (int i = 0; i < 8; i++) {
        thresh[i] = *(uint32_t*)address;
        address += 4;
    }
}


